## Imports and configurations
---

In [1]:
import numpy as np
import pandas as pd
# import matplotlib.pyplot as plt
# import psycopg2

%matplotlib inline
%load_ext sql
%config SqlMagic.displaylimit = 20
%config SqlMagic.autolimit = 30

In [2]:
import json
import urllib.parse

with open('data/credentials.json') as f:
    login = json.load(f)
    
username = login['user']
password = urllib.parse.quote(login['password'])
host = login['host']
port = login['port']

In [3]:
%sql postgresql://{username}:{password}@{host}:{port}/imdb

'Connected: postgres@imdb'

In [4]:
%sql postgresql://{username}:{password}@{host}:{port}/imdb

%sql \dt

 * postgresql://postgres:***@localhost:5432/imdb
7 rows affected.

[('public', 'acting_roles', 'table', 'postgres'),
 ('public', 'aliases', 'table', 'postgres'),
 ('public', 'crew_roles', 'table', 'postgres'),
 ('public', 'movie_genres', 'table', 'postgres'),
 ('public', 'movies', 'table', 'postgres'),
 ('public', 'names', 'table', 'postgres'),
 ('public', 'principals', 'table', 'postgres')]

In [5]:
%sql postgresql://{username}:{password}@{host}:{port}/world

%sql \dt

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
3 rows affected.

[('public', 'city', 'table', 'postgres'),
 ('public', 'country', 'table', 'postgres'),
 ('public', 'countrylanguage', 'table', 'postgres')]

## Mistake1 : Miss up keyword orders and execution orders
---

In [24]:
%sql postgresql://{username}:{password}@{host}:{port}/imdb

'Connected: postgres@imdb'

In [25]:
%%sql

SELECT *
FROM
    movies
LIMIT 5
;

 * postgresql://postgres:***@localhost:5432/imdb
   postgresql://postgres:***@localhost:5432/world
5 rows affected.

[(10035423, 'Kate & Leopold', None, 2001, None, 118, 6.4, 74982),
 (10042742, 'Mister 880', None, 1950, None, 90, 7.1, 1171),
 (10041181, 'Black Hand', None, 1950, None, 92, 6.4, 666),
 (10041387, 'Francis', None, 1950, None, 91, 6.4, 979),
 (10041719, 'Orpheus', 'Orphée', 1950, None, 95, 8.0, 9346)]

In [27]:
%%sql

SELECT
    title AS Title,
    start_year AS Year,
    runtime AS Duration,
    rating AS Rating,
    nvotes AS NumberOfVotes
FROM
    movies
WHERE
    NumberOfVotes > 1000
;

 * postgresql://postgres:***@localhost:5432/imdb
   postgresql://postgres:***@localhost:5432/world
(psycopg2.errors.UndefinedColumn) column "numberofvotes" does not exist
LINE 10:     NumberOfVotes > 1000
             ^

[SQL: SELECT
    title AS Title,
    start_year AS Year,
    runtime AS Duration,
    rating AS Rating,
    nvotes AS NumberOfVotes
FROM
    movies
WHERE
    NumberOfVotes > 1000
;]
(Background on this error at: https://sqlalche.me/e/14/f405)

<br>

**Order of clauses in a statement:**

```sql
    SELECT
      |
     FROM
      |
     JOIN
      |
    WHERE
      |
  GROUP BY
      |
    HAVING
      |
   ORDER BY
      |
    LIMIT
```

<br>

**Order of execution/processing:**

```sql
FROM and JOIN
      |
    WHERE
      |
  GROUP BY
      |
    HAVING
      |
    SELECT
      |
   DISTINCT
      |
   ORDER BY
      |
    LIMIT
```

## Mistake2 : Not beware of the logical statement
---

In [9]:
%sql postgresql://{username}:{password}@{host}:{port}/imdb

'Connected: postgres@imdb'

In [36]:
%%sql

SELECT
    *
FROM
    movies
WHERE
    start_year = 2010
    OR 
    start_year = 2020
    AND
    rating > 8
    AND
    nvotes > 1000
LIMIT 15
;

 * postgresql://postgres:***@localhost:5432/imdb
   postgresql://postgres:***@localhost:5432/world
15 rows affected.

[(10398286, 'Tangled', None, 2010, None, 100, 7.7, 373355),
 (10429493, 'The A-Team', None, 2010, None, 117, 6.7, 237537),
 (10435761, 'Toy Story 3', None, 2010, None, 103, 8.3, 701340),
 (10445054, '7 Days', 'Les 7 jours du talion', 2010, None, 105, 6.5, 6775),
 (10446029, 'Scott Pilgrim vs. the World', None, 2010, None, 112, 7.5, 345332),
 (10455407, 'The Crazies', None, 2010, None, 101, 6.5, 105603),
 (10473075, 'Prince of Persia: The Sands of Time', None, 2010, None, 116, 6.6, 258475),
 (10473102, 'The Perfect Game', None, 2010, None, 118, 7.0, 3113),
 (10477080, 'Unstoppable', None, 2010, None, 98, 6.7, 174994),
 (10480255, 'The Losers', None, 2010, None, 97, 6.3, 85804),
 (10483586, 'Chasing 3000', None, 2010, None, 115, 6.4, 766),
 (10493949, 'Ramona and Beezus', None, 2010, None, 103, 6.5, 16309),
 (10758752, 'Love & Other Drugs', None, 2010, None, 112, 6.7, 169975),
 (10775489, 'The Illusionist', "L'illusionniste", 2010, None, 80, 7.5, 32055),
 (10790663, 'The First Grader', None, 2010, None, 103, 7.5, 4107)]

In [39]:
%%sql

SELECT
    *
FROM
    movies
WHERE
    (start_year = 2010
    OR 
    start_year = 2020)
    AND
    rating > 8
    AND
    nvotes > 1000
LIMIT 15
;

 * postgresql://postgres:***@localhost:5432/imdb
   postgresql://postgres:***@localhost:5432/world
15 rows affected.

[(10435761, 'Toy Story 3', None, 2010, None, 103, 8.3, 701340),
 (10892769, 'How to Train Your Dragon', None, 2010, None, 98, 8.1, 621377),
 (11545103, 'Rush: Beyond the Lighted Stage', None, 2010, None, 107, 8.4, 3701),
 (11603362, 'Prasthanam', None, 2010, None, 153, 8.4, 2178),
 (11634013, 'Montevideo: Taste of a Dream', 'Montevideo, Bog te video!', 2010, None, 140, 8.2, 10594),
 (11639426, 'Udaan', None, 2010, None, 134, 8.2, 39392),
 (11645089, 'Inside Job', None, 2010, None, 109, 8.2, 65999),
 (11649431, 'Vedam', None, 2010, None, 135, 8.1, 5955),
 (11670703, 'Footsteps in the Sand', 'Stapki v pyasaka', 2010, None, 89, 8.2, 1429),
 (11789083, 'The Weight of Chains', None, 2010, None, 125, 8.3, 3912),
 (11789810, 'José and Pilar', 'José e Pilar', 2010, None, 117, 8.3, 2216),
 (11807022, 'Super', None, 2010, None, 140, 8.1, 1908),
 (11813757, 'Who Killed Captain Alex?', None, 2010, None, 64, 8.2, 5345),
 (11809387, "The War You Don't See", None, 2010, None, 97, 8.4, 1124),
 (11814642, 'Bad Hero', None, 2010, None, 73, 8.4, 1204)]

In [11]:
%%sql

SELECT
    *
FROM
    movies
WHERE
    (start_year = 2015
    OR
    start_year = 2018)
    AND
    rating > 8
;

 * postgresql://postgres:***@localhost:5432/imdb
   postgresql://postgres:***@localhost:5432/world
119 rows affected.

[(11618448, 'Racing Extinction', None, 2015, None, 90, 8.3, 7042),
 (12096673, 'Inside Out', None, 2015, None, 95, 8.2, 550606),
 (12473476, 'Be Here Now', None, 2015, None, 100, 8.7, 2863),
 (12631186, 'Baahubali: The Beginning', 'Bahubali: The Beginning', 2015, None, 159, 8.1, 94989),
 (12865822, 'All the World in a Design School', None, 2015, None, 59, 8.4, 1270),
 (13170832, 'Room', None, 2015, None, 118, 8.2, 326042),
 (13270538, 'Requiem for the American Dream', None, 2015, None, 73, 8.1, 8061),
 (13717510, 'The Drop Box', None, 2015, None, 79, 8.1, 604),
 (13865286, 'My Lonely Me', None, 2015, None, 95, 8.2, 671),
 (14112208, 'Kuttram Kadithal', None, 2015, None, 120, 8.1, 638),
 (14145178, 'Listen to Me Marlon', None, 2015, None, 103, 8.2, 6447),
 (14154756, 'Avengers: Infinity War', None, 2018, None, 149, 8.5, 711500),
 (14393514, 'Bitter Lake', None, 2015, None, 136, 8.2, 2356),
 (14430212, 'Drishyam', None, 2015, None, 163, 8.3, 57527),
 (14429128, 'Papanasam', None, 2015, None, 179, 8.4, 4802),
 (14449576, 'Tomorrow', 'Demain', 2015, None, 118, 8.1, 2887),
 (14476736, 'Hamlet', 'National Theatre Live: Hamlet', 2015, None, 217, 8.6, 1670),
 (14519488, 'Mudras Calling', None, 2018, None, 95, 8.7, 1196),
 (14635372, 'Masaan', None, 2015, None, 109, 8.1, 19638),
 (14633694, 'Spider-Man: Into the Spider-Verse', None, 2018, None, 117, 8.4, 262505),
 (14658770, 'Belaseshe', None, 2015, None, 141, 8.5, 1745),
 (14679210, 'Premam', None, 2015, None, 156, 8.3, 14257),
 (14730224, 'An Hour to Kill', None, 2018, None, 96, 8.6, 2325),
 (14833824, 'Uppi 2', None, 2015, None, 135, 8.1, 7748),
 (14881362, 'Thithi', None, 2015, None, 123, 8.3, 2104),
 (14908644, "Winter on Fire: Ukraine's Fight for Freedom", None, 2015, None, 102, 8.4, 10970),
 (14934950, 'Talvar', None, 2015, None, 132, 8.2, 26337),
 (14928620, 'Pathemari', None, 2015, None, 118, 8.4, 3328),
 (14943992, 'Manto', None, 2015, None, 127, 8.5, 1079),
 (14973112, 'Hitting the Apex', None, 2015, None, 138, 8.4, 2573)]

## Mistake3 : Aggregration and Grouping
---

In [40]:
%sql postgresql://{username}:{password}@{host}:{port}/world

'Connected: postgres@world'

In [41]:
%%sql

SELECT *
FROM
    country
LIMIT 5
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
5 rows affected.

[('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', 652090.0, 1919, 22720000, 45.9, Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('NLD', 'Netherlands', 'Europe', 'Western Europe', 41526.0, 1581, 15864000, 78.3, Decimal('371362.00'), Decimal('360478.00'), 'Nederland', 'Constitutional Monarchy', 'Beatrix', 5, 'NL'),
 ('ANT', 'Netherlands Antilles', 'North America', 'Caribbean', 800.0, None, 217000, 74.7, Decimal('1941.00'), None, 'Nederlandse Antillen', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 33, 'AN'),
 ('ALB', 'Albania', 'Europe', 'Southern Europe', 28748.0, 1912, 3401200, 71.6, Decimal('3205.00'), Decimal('2500.00'), 'Shqipëria', 'Republic', 'Rexhep Mejdani', 34, 'AL'),
 ('DZA', 'Algeria', 'Africa', 'Northern Africa', 2381741.0, 1962, 31471000, 69.7, Decimal('49982.00'), Decimal('46966.00'), 'Al-Jaza\x92ir/Algérie', 'Republic', 'Abdelaziz Bouteflika', 35, 'DZ')]

In [42]:
%%sql

SELECT
    AVG(population)
FROM
    country
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
1 rows affected.

[(Decimal('25434098.117154811715'),)]

In [43]:
%%sql

SELECT
    AVG(population), name
FROM
    country
WHERE
    continent = 'North America'
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
(psycopg2.errors.GroupingError) column "country.name" must appear in the GROUP BY clause or be used in an aggregate function
LINE 2:     AVG(population), name
                             ^

[SQL: SELECT
    AVG(population), name
FROM
    country
WHERE
    continent = 'North America'
;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [45]:
%%sql

SELECT
    AVG(population), name
FROM
    country
WHERE
    continent = 'North America'
GROUP BY
    name
LIMIT 10
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
10 rows affected.

[(Decimal('6276000.000000000000'), 'El Salvador'),
 (Decimal('154000.000000000000'), 'Saint Lucia'),
 (Decimal('6485000.000000000000'), 'Honduras'),
 (Decimal('241000.000000000000'), 'Belize'),
 (Decimal('21000.000000000000'), 'Virgin Islands, British'),
 (Decimal('395000.000000000000'), 'Martinique'),
 (Decimal('8495000.000000000000'), 'Dominican Republic'),
 (Decimal('11385000.000000000000'), 'Guatemala'),
 (Decimal('71000.000000000000'), 'Dominica'),
 (Decimal('31147000.000000000000'), 'Canada')]

In [46]:
%%sql

SELECT
    name
FROM
    country
WHERE
    population > AVG(population)
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
(psycopg2.errors.GroupingError) aggregate functions are not allowed in WHERE
LINE 6:     population > AVG(population)
                         ^

[SQL: SELECT
    name
FROM
    country
WHERE
    population > AVG(population)
;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [16]:
%%sql

SELECT
    AVG(lifeexpectancy), SUM(population)
FROM
    country
WHERE
    continent = 'North America'
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
1 rows affected.

[(72.99189170631203, 482993000)]

In [17]:
%%sql

SELECT
    continent, AVG(population)
FROM
    country
GROUP BY
    continent
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
7 rows affected.

[('Asia', Decimal('72647562.745098039216')),
 ('South America', Decimal('24698571.428571428571')),
 ('North America', Decimal('13053864.864864864865')),
 ('Oceania', Decimal('1085755.357142857143')),
 ('Antarctica', Decimal('0E-20')),
 ('Africa', Decimal('13525431.034482758621')),
 ('Europe', Decimal('15871186.956521739130'))]

In [47]:
%%sql

SELECT
    countrycode, AVG(population), MAX(population)
FROM
    city
WHERE
    countrycode IN ('CAN', 'USA', 'THA')
GROUP BY
    countrycode
ORDER BY
    countrycode
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
3 rows affected.

[('CAN', Decimal('258649.795918367347'), 1016376),
 ('THA', Decimal('662763.416666666667'), 6320174),
 ('USA', Decimal('286955.379562043796'), 8008278)]

In [19]:
%%sql

SELECT
    countrycode,
    AVG(population)::int,
    MAX(population)::int,
    COUNT(population) AS city_count
FROM
    city
GROUP BY
    countrycode
HAVING
    COUNT(*) > 60
ORDER BY
    city_count DESC
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
15 rows affected.

[('CHN', 484721, 9696300, 363),
 ('IND', 361579, 10500000, 341),
 ('USA', 286955, 8008278, 274),
 ('BRA', 343507, 9968485, 250),
 ('JPN', 314375, 7980230, 248),
 ('RUS', 365877, 8389200, 189),
 ('MEX', 345390, 8591309, 173),
 ('PHL', 227462, 2173831, 136),
 ('DEU', 282209, 3386667, 93),
 ('IDN', 441008, 9604900, 85),
 ('GBR', 276996, 7285000, 81),
 ('KOR', 557141, 9981619, 70),
 ('IRN', 388552, 6758845, 67),
 ('NGA', 271358, 1518000, 64),
 ('TUR', 456888, 8787958, 62)]

In [20]:
%%sql

SELECT
    countrycode,
    AVG(population)::INT,
    MAX(population)::INT
FROM
    city
GROUP BY
    countrycode
HAVING
    COUNT(*) > 60
ORDER BY
    COUNT(*) DESC
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
15 rows affected.

[('CHN', 484721, 9696300),
 ('IND', 361579, 10500000),
 ('USA', 286955, 8008278),
 ('BRA', 343507, 9968485),
 ('JPN', 314375, 7980230),
 ('RUS', 365877, 8389200),
 ('MEX', 345390, 8591309),
 ('PHL', 227462, 2173831),
 ('DEU', 282209, 3386667),
 ('IDN', 441008, 9604900),
 ('GBR', 276996, 7285000),
 ('KOR', 557141, 9981619),
 ('IRN', 388552, 6758845),
 ('NGA', 271358, 1518000),
 ('TUR', 456888, 8787958)]

In [21]:
%%sql

SELECT
    continent, region, AVG(population)::INT
FROM
    country
GROUP BY
    continent, region
ORDER BY
    continent, region
;

   postgresql://postgres:***@localhost:5432/imdb
 * postgresql://postgres:***@localhost:5432/world
25 rows affected.

[('Africa', 'Central Africa', 10628000),
 ('Africa', 'Eastern Africa', 12349950),
 ('Africa', 'Northern Africa', 24752286),
 ('Africa', 'Southern Africa', 9377200),
 ('Africa', 'Western Africa', 13039529),
 ('Antarctica', 'Antarctica', 0),
 ('Asia', 'Eastern Asia', 188416000),
 ('Asia', 'Middle East', 10465594),
 ('Asia', 'Southeast Asia', 47140091),
 ('Asia', 'Southern and Central Asia', 106484000),
 ('Europe', 'Baltic Countries', 2520633),
 ('Europe', 'British Islands', 31699250),
 ('Europe', 'Eastern Europe', 30702600),
 ('Europe', 'Nordic Countries', 3452343),
 ('Europe', 'Southern Europe', 9644947),
 ('Europe', 'Western Europe', 20360844),
 ('North America', 'Caribbean', 1589167),
 ('North America', 'Central America', 16902625),
 ('North America', 'North America', 61926400),
 ('Oceania', 'Australia and New Zealand', 4550620),
 ('Oceania', 'Melanesia', 1294400),
 ('Oceania', 'Micronesia', 77571),
 ('Oceania', 'Micronesia/Caribbean', 0),
 ('Oceania', 'Polynesia', 63305),
 ('South America', 'South America', 24698571)]